Autodesk.Revit.DB.TagByExample.IsAllowedTag(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if the tag is allowed as an example tag.
Remarks:
The tag must be an IndependentTag on a family instance or wall, or a SpatialElementTag.
IndependentTags can't be material tags, orphaned tags, or keynote tags.
SpatialElementTags can't be orphaned.
document:
The document what owns the tag.
tagId:
The id of the tag to check.
Returns:
True if the tag is allowed as an example tag, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.2

Autodesk.Revit.DB.TagByExample.IsAllowedView(Autodesk.Revit.DB.View)
Checks if the view is allowed.
Remarks:
Tag By Example is allowed in plan, section, and elevation views.
view:
View to check.
Returns:
True if the view is allowed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.2

Autodesk.Revit.DB.TagByExample.CanTagBeCreatedOnHost(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId)
Checks that the example tag can be created on the host.
document:
The document to which the tag will be added.
view:
The view in which the example tag are visible and the new tag will be created.
exampleTagId:
The id of the example tag.
targetHostId:
The host id to tag. The host may be in a rvt link instance.
Returns:
True if the example tag can be created on the host, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.2

Autodesk.Revit.DB.TagByExample.CreateTagByExample(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.TagByExampleOptions)
Create a new tag according to an example tag and a target host.
document:
The document which owns the example tag and view.
view:
The view in which the example tag is visible and the new tag will be created.
exampleTagId:
The id of the example tag to recreate.
targetHost:
The id of the target host to tag. The host may be in a rvt link instance.
options:
The creation options which control the placement of the new tag.
Returns:
The id of the new tag.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The view is not allowed for Tag By Example.
-or-
The example tag cannot be created on the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027.2

Autodesk.Revit.DB.TagByExample
Tag By Example creates new tags by using an example tag as a reference
and applying it to target hosts.
Since:
2027.2